**Introduction to Python**: 
This is a basic introduction to python using jupyter notebooks. 
You are going to walk through this example and recreate your own version 
assigning DIFFERENT VARIABLES AND NUMBERS. 
For example: If I write x=2 (to assign a variable) you write something else (e.g., x=1). This is just to get you reading and typing instead of copy & pasting (only ;) )

Please feel free to go ahead, use additional resources, and scrape the Internet for anything you want to bring into your notebook. You can copy the notes (i.e., Markdown cells), add in more, paste hyper links etc. 

If you forget what a function does or what inputs you need, type it out and hit "Shift+tab" while your cursor is on it for tooltips and tab autocomplete.

In [22]:
import pandas as pd

# Variables

A name that is used to denote something or a value is called a variable. In python, variables can be declared and values can be assigned to it as follows,

In [61]:
x = 5
y = 3
xy = 'Hi Big Data Class, my name is Roy'

In [62]:
print x-y, xy

2 Hi Big Data Class, my name is Roy

Multiple variables can be assigned with the same value.

In [63]:
x = y = 3

In [64]:
print x,y,

3 3

# Operators

## Arithmetic Operators

| Symbol | Task Performed |
|----|---|
| +  | Addition |
| -  | Subtraction |
| /  | division |
| %  | mod |
| *  | multiplication |
| //  | floor division |
| **  | to the power of |

In [65]:
3+2

5

In [66]:
9-1

8

In [67]:
10*2

20

In [68]:
11/22

0

Why 0? This is because both the numerator and denominator are integers but the result is a float value hence an integer value is returned. 

By changing either the numerator or the denominator to float, correct answer can be obtained.

In [69]:
10/2.5

4.0

In [70]:
25%12

1

Floor division is nothing but converting the result so obtained to the nearest integer.

In [71]:
4.8//2.0

2.0

## Relational Operators

| Symbol | Task Performed |
|----|---|
| == | True, if it is equal |
| !=  | True, if not equal to |
| < | less than |
| > | greater than |
| <=  | less than or equal to |
| >=  | greater than or equal to |

In [72]:
z = 2

In [73]:
z == 2

True

In [74]:
z > 1

True

## Bitwise Operators (we won't cover these beyond this example

| Symbol | Task Performed |
|----|---|
| &  | Logical And |
| l  | Logical OR |
| ^  | XOR |
| ~  | Negate |
| >>  | Right shift |
| <<  | Left shift |

**int( )** accepts two values when used for conversion, one is the value in a different number system and the other is its base. Note that input number in the different number system should be of string type.

In [75]:
print int('010',9)
print int('0xaa',16)
print int('1010',9)

9
170
738

##

**int( )** can also be used to get only the integer value of a float number or can be used to convert a number which is of type string to integer format. Similarly, the function **str( )** can be used to convert the integer back to string format

In [76]:
print int(97.77)
print int('227')

97
227

**float()** creates a float (decimal, real number)

In [77]:
print float(9999)
print float(23)

9999.0
23.0

Also note that function **bin( )** is used for binary and **float( )** for decimal/float values. **chr( )** is used for converting ASCII to its alphabet equivalent, **ord( )** is used for the other way round.

In [78]:
chr(37)

'%'

In [79]:
ord('%')

37

## Simplifying Arithmetic Operations

**round( )** function rounds the input value to a specified number of places or to the nearest integer.

In [80]:
print round(125.9731) 
print round(99.55892, 4)

126.0
99.5589

**complex( )** is used to define a complex number and **abs( )** outputs the absolute value of the same.

In [81]:
c =complex('66+7j')
print abs(c)

66.3701740242

**isinstance( )** returns True, if the first argument is an instance of that class. Multiple classes can also be checked at once.

In [82]:
print isinstance(6.7, int)
print isinstance(9,int)
print isinstance(5.033,(int,float))

False
True
True

**cmp(x,y)** Compare the two objects x and y and return an integer according to the outcome.

|x ? y|Output|
|---|---|
| x < y | -1 |
| x == y | 0 |
| x > y | 1 |

In [83]:
print cmp(11,23)
print cmp(19,19)
print cmp(9,7)

-1
0
1

**pow(x,y,z)** can be used to find the power $x^y$ also the mod of the resulting value with the third specified number can be found i.e. : ($x^y$ % z).

In [84]:
print pow(6,3)
print pow(3,6,2)

216
1

**range( )** function outputs the integers of the specified range. It can also be used to generate a series by specifying the difference between the two numbers within a particular range. The elements are returned in a list (will be discussing in detail later.)

In [85]:
print range(6)
print range(0,10)
print range(4,36,9)

[0, 1, 2, 3, 4, 5]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
[4, 13, 22, 31]

#Print Statement

The **print** statement can be used in the following different ways :

    - print "Hello World"
    - print "Hello", <Variable Containing the String>
    - print "Hello" + <Variable Containing the String>
    - print "Hello %s" % <variable containing the string>

In [86]:
print "Hello York University"

Hello York University

In Python, single, double and triple quotes are used to denote a string.
Most use single quotes when declaring a single character. 
Double quotes when declaring a line and triple quotes when declaring a paragraph/multiple lines.

In [87]:
print 'hi'

hi

In [88]:
print """My name is Roy

I love pizza

more than hamburgers."""

My name is Roy

I love pizza

more than hamburgers.

Strings can be assigned to variable say _string1_ and _string2_ which can called when using the print statement.

In [89]:
string1 = 'York University'
print 'Hi', string1

string2 = '!!!!!!!'
print 'Hello', string1, string2

string3 = 'Welcome to'
print string3, string1, string2

Hi York University
Hello York University !!!!!!!
Welcome to York University !!!!!!!

String concatenation is the "addition" of two strings. Observe that while concatenating there will be no space between the strings.

In [90]:
print 'Hello' + string1 + string2

HelloYork University!!!!!!!

**%s** is used to refer to a variable which contains a string.

In [91]:
print "Hello %s" % string1

Hello York University

Similarly, when using other data types

    - %s -> string
    - %d -> Integer
    - %f -> Float
    - %o -> Octal
    - %x -> Hexadecimal
    - %e -> exponential
    
This can be used for conversions inside the print statement itself.

In [92]:
print "Actual Number = %d" %166
print "Float of the number = %f" %166
print "Octal equivalent of the number = %o" %166
print "Hexadecimal equivalent of the number = %x" %166
print "Exponential equivalent of the number = %e" %166

Actual Number = 166
Float of the number = 166.000000
Octal equivalent of the number = 246
Hexadecimal equivalent of the number = a6
Exponential equivalent of the number = 1.660000e+02

When referring to multiple variables parenthesis is used.

In [93]:
print "Hello %s %s" %(string1,string2)

Hello York University !!!!!!!

## Other Examples

The following are other different ways the print statement can be put to use.

In [94]:
print "I want %d to be printed %s" % (22,'here')

I want 22 to be printed here

In [95]:
print '_ZZ'*5

_ZZ_ZZ_ZZ_ZZ_ZZ

In [96]:
print "Monday\nTuesday\nWednesday\nThursday\nFriday"

Monday
Tuesday
Wednesday
Thursday
Friday

In [97]:
print "I want \\n to be printed."

I want \n to be printed.

In [98]:
print """
Routine:
\t- Eat
\t- Sleep\n\t- Repeat
"""

print """
Routine:
\t- brush teeth
\t- rinse mouth\n\t- repeat"""

Routine:
	- Eat
	- Sleep
	- Repeat


Routine:
	- brush teeth
	- rinse mouth
	- repeat

# Data Structures

In simple terms, It is the the collection or group of data in a particular structure.

## Lists

Lists are the most commonly used data structure. Think of it as a sequence of data that is enclosed in square brackets and data are separated by a comma. Each of these data can be accessed by calling it's index value.

Lists are declared by just equating a variable to '[ ]' or list.

In [99]:
a = []

In [100]:
print type(a)

<type 'list'>

One can directly assign the sequence of data to a list x as shown.

In [101]:
x = ['carrots', 'celery']
print x

['carrots', 'celery']

### Indexing

In python, Indexing starts from 0. Thus now the list x, which has two elements will have carrots at 0 index and celery at 1 index.

In [102]:
x[0]

'carrots'

Indexing can also be done in reverse order. That is the last element can be accessed first. Here, indexing starts from -1. Thus index value -1 will be celery and index -2 will be carrots.

In [103]:
x[-2]

'carrots'

As you might have already guessed, x[0] = x[-2], x[1] = x[-1]. This concept can be extended towards lists with more many elements.

In [104]:
y = ['peas','beans']

Here we have declared two lists x and y each containing its own data. Now, these two lists can again be put into another list say z which will have it's data as two lists. This list inside a list is called as nested lists and is how an array would be declared which we will see later.

In [105]:
z  = [x,y]
print z

[['carrots', 'celery'], ['peas', 'beans']]

Indexing in nested lists can be quite confusing if you do not understand how indexing works in python. So let us break it down and then arrive at a conclusion.

Let us access the data 'carrots' in the above nested list.
First, at index 0 there is a list ['carrots','celery'] and at index 1 there is another list ['peas','beans']. Hence z[0] should give us the first list which contains 'carrots'.

In [106]:
z1 = z[0]
print z1

['carrots', 'celery']

Now observe that z1 is not at all a nested list thus to access 'carrots', z1 should be indexed at 0.

In [107]:
z1[0]

'carrots'

Instead of doing the above, In python, you can access 'carrots' by just writing the index values each time side by side.

In [108]:
z[0][0]

'carrots'

If there was a list inside a list inside a list then you can access the innermost value by executing z[ ][ ][ ].

### Slicing

Indexing was only limited to accessing a single element, Slicing on the other hand is accessing a sequence of data inside the list. In other words "slicing" the list.

Slicing is done by defining the index values of the first element and the last element from the parent list that is required in the sliced list. It is written as parentlist[ a : b ] where a,b are the index values from the parent list. If a or b is not defined then the index value is considered to be the first value for a if a is not defined and the last value for b when b is not defined.

In [109]:
num = [10,11,12,13,14,15,16,17,18,19]

In [110]:
print num[1:4]
print num[6:]

[11, 12, 13]
[16, 17, 18, 19]

You can also slice a parent list with a fixed length or step length.

In [111]:
num[:9:2]

[10, 12, 14, 16, 18]

### Built in List Functions

To find the length of the list or the number of elements in a list, **len( )** is used.

In [112]:
len(num)

10

If the list consists of all integer elements then **min( )** and **max( )** gives the minimum and maximum value in the list.

In [113]:
min(num)

10

In [114]:
max(num)

19

Lists can be concatenated by adding, '+' them. The resultant list will contain all the elements of the lists that were added. The resultant list will not be a nested list.

In [115]:
[100,200,300] + [500,400,700]

[100, 200, 300, 500, 400, 700]

There might arise a requirement where you might need to check if a particular element is there in a predefined list. Consider the below list.

In [116]:
names = ['Earth','Venus','Saturn','Pluto']

To check if 'Earth' and 'Roy' is present in the list names. A conventional approach would be to use a for loop and iterate over the list and use the if condition. But in python you can use 'a in b' concept which would return 'True' if a is present in b and 'False' if not.

In [117]:
'Earth' in names

True

In [118]:
'Roy' in names

False

In a list with elements as string, **max( )** and **min( )** is applicable. **max( )** would return a string element whose ASCII value is the highest and the lowest when **min( )** is used. Note that only the first index of each element is considered each time and if they value is the same then second index considered so on and so forth.

In [119]:
mlist = ['bee','do','no','acc','zoo','klm']

In [120]:
print max(mlist)
print min(mlist)

zoo
acc

Here the first index of each element is considered and thus z has the highest ASCII value thus it is returned and minimum ASCII is a. But what if numbers are declared as strings?

In [121]:
nlist = ['1','54','63','99']

In [122]:
print max(nlist)
print min(nlist)

99
1

Even if the numbers are declared in a string the first index of each element is considered and the maximum and minimum values are returned accordingly.

But if you want to find the **max( )** string element based on the length of the string then another parameter 'key=len' is declared inside the **max( )** and **min( )** function.

In [123]:
print max(names, key=len)
print min(names, key=len)

Saturn
Earth

But even 'Water' has length 5. **max()** or **min()** function returns the first element when there are two or more elements with the same length.

Any other built in function can be used or lambda function (will be discussed later) in place of len.

A string can be converted into a list by using the **list()** function.

In [124]:
list('goodbye')

['g', 'o', 'o', 'd', 'b', 'y', 'e']

**append( )** is used to add a element at the end of the list.

In [125]:
lst = [11,21,42,81,71]

In [126]:
lst.append(44)
print lst

[11, 21, 42, 81, 71, 44]

**count( )** is used to count the number of a particular element that is present in the list.

In [127]:
lst.count(11)

1

**append( )** function can also be used to add a entire list at the end. Observe that the resultant list becomes a nested list.

In [128]:
lst1 = [5,4,2,8]

In [129]:
lst.append(lst1)
print lst

[11, 21, 42, 81, 71, 44, [5, 4, 2, 8]]

But if nested list is not what is desired then **extend( )** function can be used.

In [130]:
lst.extend(lst1)
print lst

[11, 21, 42, 81, 71, 44, [5, 4, 2, 8], 5, 4, 2, 8]

**index( )** is used to find the index value of a particular element. Note that if there are multiple elements of the same value then the first index value of that element is returned.

In [131]:
lst.index(11)

0

**insert(x,y)** is used to insert a element y at a specified index value x. **append( )** function made it only possible to insert at the end.

In [132]:
lst.insert(5, 'Roy')
print lst

[11, 21, 42, 81, 71, 'Roy', 44, [5, 4, 2, 8], 5, 4, 2, 8]

**insert(x,y)** inserts but does not replace element. If you want to replace the element with another element you simply assign the value to that particular index.

In [133]:
lst[5] = 'Week2'
print lst

[11, 21, 42, 81, 71, 'Week2', 44, [5, 4, 2, 8], 5, 4, 2, 8]

**pop( )** function return the last element in the list. This is similar to the operation of a stack. Hence it wouldn't be wrong to tell that lists can be used as a stack.

In [134]:
lst.pop()

8

Index value can be specified to pop a ceratin element corresponding to that index value.

In [135]:
lst.pop(0)

11

**pop( )** is used to remove element based on it's index value which can be assigned to a variable. One can also remove element by specifying the element itself using the **remove( )** function.

In [136]:
lst.remove('Week2')
print lst

[21, 42, 81, 71, 44, [5, 4, 2, 8], 5, 4, 2]

Alternative to **remove** function but with using index value is **del**

In [137]:
del lst[1]
print lst

[21, 81, 71, 44, [5, 4, 2, 8], 5, 4, 2]

The entire elements present in the list can be reversed by using the **reverse()** function.

In [138]:
lst.reverse()
print lst

[2, 4, 5, [5, 4, 2, 8], 44, 71, 81, 21]

Note that the nested list [5,4,2,8] is treated as a single element of the parent list lst. Thus the elements inside the nested list is not reversed.

Python offers built in operation **sort( )** to arrange the elements in ascending order.

In [139]:
lst.sort()
print lst

[2, 4, 5, 21, 44, 71, 81, [5, 4, 2, 8]]

For descending order, By default the reverse condition will be False for reverse. Hence changing it to True would arrange the elements in descending order.

In [140]:
lst.sort(reverse=True)
print lst

[[5, 4, 2, 8], 81, 71, 44, 21, 5, 4, 2]

Similarly for lists containing string elements, **sort( )** would sort the elements based on it's ASCII value in ascending and by specifying reverse=True in descending.

In [141]:
names.sort()
print names
names.sort(reverse=True)
print names

['Earth', 'Pluto', 'Saturn', 'Venus']
['Venus', 'Saturn', 'Pluto', 'Earth']

To sort based on length key=len should be specified as shown.

In [142]:
names.sort(key=len)
print names
names.sort(key=len,reverse=True)
print names

['Venus', 'Pluto', 'Earth', 'Saturn']
['Saturn', 'Venus', 'Pluto', 'Earth']

### Copying a list

Most of the new python programmers commit this mistake. Consider the following,

In [143]:
lista= [20,11,44,33]

In [144]:
listb = lista
print listb

[20, 11, 44, 33]

Here, We have declared a list, lista = [20,11,44,33]. This list is copied to listb by assigning it's value and it get's copied as seen. Now we perform some random operations on lista.

In [145]:
lista.pop()
print lista
lista.append(9)
print lista

[20, 11, 44]
[20, 11, 44, 9]

In [146]:
print listb

[20, 11, 44, 9]

listb has also changed though no operation has been performed on it. This is because you have assigned the same memory space of lista to listb. So how do fix this?

If you recall, in slicing we had seen that parentlist[a:b] returns a list from parent list with start index a and end index b and if a and b is not mentioned then by default it considers the first and last element. We use the same concept here. By doing so, we are assigning the data of lista to listb as a variable.

In [147]:
lista = [20,11,44,33]

In [148]:
listb = lista[:]
print listb

[20, 11, 44, 33]

In [149]:
lista.pop()
print lista
lista.append(9)
print lista

[20, 11, 44]
[20, 11, 44, 9]

In [150]:
print listb

[20, 11, 44, 33]

##Tuples

Tuples are similar to lists but only big difference is the elements inside a list can be changed but in tuple it cannot be changed. Think of tuples as something which has to be True for a particular something and cannot be True for no other values. For better understanding, Recall **divmod()** function.

In [151]:
xyz = divmod(10,3)
print xyz
print type(xyz)

(3, 1)
<type 'tuple'>

Here the quotient has to be 3 and the remainder has to be 1. These values cannot be changed whatsoever when 10 is divided by 3. Hence divmod returns these values in a tuple.

To define a tuple, A variable is assigned to paranthesis ( ) or tuple( ).

In [152]:
tup = ()
tup2 = tuple()

If you want to directly declare a tuple it can be done by using a comma at the end of the data.

In [153]:
35,

(35,)

35 when multiplied by 2 yields 70, But when multiplied with a tuple the data is repeated twice.

In [154]:
2*(35,)

(35, 35)

Values can be assigned while declaring a tuple. It takes a list as input and converts it into a tuple or it takes a string and converts it into a tuple.

In [155]:
tup3 = tuple([6,21,38])
print tup3
tup4 = tuple('Goodbye')
print tup4

(6, 21, 38)
('G', 'o', 'o', 'd', 'b', 'y', 'e')

It follows the same indexing and slicing as Lists.

In [156]:
print tup3[1]
tup5 = tup4[:5]
print tup5

21
('G', 'o', 'o', 'd', 'b')

### Mapping one tuple to another

In [157]:
(a,b,c)= ('alpha','beta','gamma')

In [158]:
print a,b,c

alpha beta gamma

In [159]:
d = tuple('RoyHam')
print d

('R', 'o', 'y', 'H', 'a', 'm')

### Built In Tuple functions

**count()** function counts the number of specified element that is present in the tuple.

In [160]:
d.count('y')

1

**index()** function returns the index of the specified element. If the elements are more than one then the index of the first element of that specified element is returned

In [161]:
d.index('y')

2

##Sets

Sets are mainly used to eliminate repeated numbers in a sequence/list. It is also used to perform some standard set operations.

Sets are declared as set() which will initialize a empty set. Also set([sequence]) can be executed to declare a set with elements

In [162]:
set1 = set()
print type(set1)

<type 'set'>

In [163]:
set0 = set([1,2,2,3,4,4,5,5,7])
print set0

set([1, 2, 3, 4, 5, 7])

elements 2,4,5 which are repeated twice are seen only once. Thus in a set each element is distinct.

### Built-in Functions

In [164]:
set1 = set([0,1,2,3,88])

In [165]:
set2 = set([2,3,4,5,6,88])

**union( )** function returns a set which contains all the elements of both the sets without repition.

In [166]:
set1.union(set2)

{0, 1, 2, 3, 4, 5, 6, 88}

**add( )** will add a particular element into the set. Note that the index of the newly added element is arbitrary and can be placed anywhere not neccessarily in the end.

In [167]:
set1.add(77)
set1

{0, 1, 2, 3, 77, 88}

**intersection( )** function outputs a set which contains all the elements that are in both sets.

In [168]:
set1.intersection(set2)

{2, 3, 88}

**difference( )** function ouptuts a set which contains elements that are in set1 and not in set2.

In [169]:
set1.difference(set2)

{0, 1, 77}

**symmetric_difference( )** function ouputs a function which contains elements that are in one of the sets.

In [170]:
set2.symmetric_difference(set1)

{0, 1, 4, 5, 6, 77}

**issubset( ), isdisjoint( ), issuperset( )** is used to check if the set1/set2 is a subset, disjoint or superset of set2/set1 respectively.

In [171]:
set1.issubset(set2)

False

In [172]:
set2.isdisjoint(set1)

False

In [173]:
set2.issuperset(set1)

False

**pop( )** is used to remove an arbitrary element in the set

In [174]:
set1.pop()
print set1

set([1, 2, 3, 77, 88])

**remove( )** function deletes the specified element from the set.

In [175]:
set1.remove(2)
set1

{1, 3, 77, 88}

**clear( )** is used to clear all the elements and make that set an empty set.

In [176]:
set1.clear()
set1

set()

# Control Flow Statements

## If

if some_condition:
    
    algorithm

In [177]:
x = 35
if x >25:
    print "Good morning"

Good morning

## If-else

if some_condition:
    
    algorithm
    
else:
   
    algorithm

In [178]:
x = 35
if x > 25:
    print "Good morning"
else:
    print "Good night"

Good morning

## if-elif

if some_condition:
    
    algorithm

elif some_condition:
    
    algorithm

else:
    
    algorithm

In [179]:
x = 35
y = 116
if x > y:
    print "x>y"
elif x < y:
    print "x<y"
else:
    print "x=y"

x<y

if statement inside a if statement or if-elif or if-else are called as nested if statements.

In [180]:
x = 110
y = 129
if x > y:
    print "x>y"
elif x < y:
    print "x<y"
    if x==125:
        print "x=125"
    else:
        print "invalid"
else:
    print "x=y"

x<y
invalid

## Loops

### For

for variable in something:
    
    algorithm

In [181]:
for i in range(9):
    print i

0
1
2
3
4
5
6
7
8

In the above example, i iterates over the 0,1,2,3,4,5,6,7,8. Every time it takes each value and executes the algorithm inside the loop. It is also possible to iterate over a nested list illustrated below.

In [182]:
list_of_lists = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
for list1 in list_of_lists:
        print list1

[1, 2, 3]
[4, 5, 6]
[7, 8, 9]

A use case of a nested for loop in this case would be,

In [183]:
list_of_lists = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
for list1 in list_of_lists:
    for x in list1:
        print x

1
2
3
4
5
6
7
8
9

### While

while some_condition:
    
    algorithm

In [184]:
i = 1
while i < 3:
    print(i ** 4)
    i = i+1
print('HI')

1
16
HI

## Break

As the name says. It is used to break out of a loop when a condition becomes true when executing the loop.

In [185]:
for i in range(100):
    print i
    if i>=12:
        break

0
1
2
3
4
5
6
7
8
9
10
11
12

## Continue

This continues the rest of the loop. Sometimes when a condition is satisfied there are chances of the loop getting terminated. This can be avoided using continue statement.

In [186]:
for i in range(10):
    if i>6:
        print "Good bye."
        continue
    elif i<9:
        print i

0
1
2
3
4
5
6
Good bye.
Good bye.
Good bye.

## List Comprehensions

Python makes it simple to generate a required list with a single line of code using list comprehensions. For example If i need to generate multiples of say 33 I write the code using for loop as,

In [187]:
res = []
for i in range(1,8):
    x = 33*i
    res.append(x)
print res

[33, 66, 99, 132, 165, 198, 231]

Since you are generating another list altogether and that is what is required, List comprehensions is a more efficient way to solve this problem.

In [188]:
[33*x for x in range(1,8)]

[33, 66, 99, 132, 165, 198, 231]

That's it!. Only remember to enclose it in square brackets

Understanding the code, The first bit of the code is always the algorithm and then leave a space and then write the necessary loop. But you might be wondering can nested loops be extended to list comprehensions? Yes you can.

In [189]:
[33*x for x in range(1,20) if x<=8]

[33, 66, 99, 132, 165, 198, 231, 264]

Let me add one more loop to make you understand better,

In [190]:


[33*z for i in range(50) if i==33 for z in range(1,8)]

[33, 66, 99, 132, 165, 198, 231]

In [1]:
import pandas as pd
import datetime

In [2]:
# create a list containing dates from 04-11 to 04-18
dt = datetime.datetime(2017,4,11)
end = datetime.datetime(2017,4,18)
step = datetime.timedelta(days=1)
dates = []

In [3]:
# populate the list
while dt < end:
    dates.append(dt.strftime('%m-%d'))
    dt += step

In [4]:
print dates

['04-11', '04-12', '04-13', '04-14', '04-15', '04-16', '04-17']

In [5]:
g = {'Date': dates, 'Tokyo' : [15,19,15,11,9,8,13], 'Paris': [-2,0,2,5,7,-5,-3], 'Mumbai':[20,18,23,19,25,27,23]}

In [6]:
print g

{'Date': ['04-11', '04-12', '04-13', '04-14', '04-15', '04-16', '04-17'], 'Paris': [-2, 0, 2, 5, 7, -5, -3], 'Mumbai': [20, 18, 23, 19, 25, 27, 23], 'Tokyo': [15, 19, 15, 11, 9, 8, 13]}

In [7]:
temps = pd.DataFrame(g)
print temps

    Date  Mumbai  Paris  Tokyo
0  04-11      20     -2     15
1  04-12      18      0     19
2  04-13      23      2     15
3  04-14      19      5     11
4  04-15      25      7      9
5  04-16      27     -5      8
6  04-17      23     -3     13

In [8]:
ntemp = temps['Paris']

In [9]:
print ntemp

0   -2
1    0
2    2
3    5
4    7
5   -5
6   -3
Name: Paris, dtype: int64

In [10]:
temps = temps.set_index('Date')

In [11]:
print temps

       Mumbai  Paris  Tokyo
Date
04-11      20     -2     15
04-12      18      0     19
04-13      23      2     15
04-14      19      5     11
04-15      25      7      9
04-16      27     -5      8
04-17      23     -3     13

In [12]:
titanic = pd.read_csv("../data/titanic.csv")

print titanic

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
5              6         0       3
6              7         0       1
7              8         0       3
8              9         1       3
9             10         1       2
10            11         1       3
11            12         1       1
12            13         0       3
13            14         0       3
14            15         0       3
15            16         1       2
16            17         0       3
17            18         1       2
18            19         0       3
19            20         1       3
20            21         0       2
21            22         1       2
22            23         1       3
23            24         1       1
24            25         0       3
25            26         1       3
26            27         0       3
27            28         0       1
28            29         1       3
29            30         0       3
..           ...       ...     ...
861          862         0       2
862          863         1       1
863          864         0       3
864          865         0       2
865          866         1       2
866          867         1       2
867          868         0       1
868          869         0       3
869          870         1       3
870          871         0       3
871          872         1       1
872          873         0       1
873          874         0       3
874          875         1       2
875          876         1       3
876          877         0       3
877          878         0       3
878          879         0       3
879          880         1       1
880          881         1       2
881          882         0       3
882          883         0       3
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
5                                     Moran, Mr. James    male   NaN      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                     Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                            Bonnell, Miss. Elizabeth  female  58.0      0
12                      Saundercock, Mr. William Henry    male  20.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
14                Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                                Rice, Master. Eugene    male   2.0      4
17                        Williams, Mr. Charles Eugene    male   NaN      0
18   Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                             Masselmani, Mrs. Fatima  female   NaN      0
20                                Fynney, Mr. Joseph J    male  35.0      0
21                               Beesley, Mr. Lawrence    male  34.0      0
22                         McGowan, Miss. Anna "Annie"  female  15.0      0
23                        Sloper, Mr. William Thompson    male  28.0      0
24                       Palsson, Miss. Torborg Danira  female   8.0      3
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...  female  38.0      1
26                             Emir, Mr. Farred Chehab    male   NaN      0
27                      Fortune, Mr. Charles Alexander    male  19.0      3
28                       O'Dwyer, Miss. Ellen "Nellie"  female   NaN      0
29                                 Todoroff, Mr. Lalio    male   NaN      0
..                                                 ...     ...   ...    ...
861                        Giles, Mr. Frederick Edward    male  21.0      1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  female  48.0      0
863                  Sage, Miss. Dorothy Edith "Dolly"  female   NaN      8
864                             Gill, Mr. John William    male  24.0      0
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
866                       Duran y More, Miss. Asuncion  female  27.0      1
867               Roebling, Mr. Washington Augustus II    male  31.0      0
868                        van Melkebeke, Mr. Philemon    male   NaN      0
869                    Johnson, Master. Harold Theodor    male   4.0      1
870                                  Balkic, Mr. Cerin    male  26.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
872                           Carlsson, Mr. Frans Olof    male  33.0      0
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
876                      Gustafsson, Mr. Alfred Ossian    male  20.0      0
877                               Petroff, Mr. Nedelio    male  19.0      0
878                                 Laleff, Mr. Kristo    male   NaN      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
881                                 Markun, Mr. Johann    male  33.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket      Fare        Cabin Embarked
0        0         A/5 21171    7.2500          NaN        S
1        0          PC 17599   71.2833          C85        C
2        0  STON/O2. 3101282    7.9250          NaN        S
3        0            113803   53.1000         C123        S
4        0            373450    8.0500          NaN        S
5        0            330877    8.4583          NaN        Q
6        0             17463   51.8625          E46        S
7        1            349909   21.0750          NaN        S
8        2            347742   11.1333          NaN        S
9        0            237736   30.0708          NaN        C
10       1           PP 9549   16.7000           G6        S
11       0            113783   26.5500         C103        S
12       0         A/5. 2151    8.0500          NaN        S
13       5            347082   31.2750          NaN        S
14       0            350406    7.8542          NaN        S
15       0            248706   16.0000          NaN        S
16       1            382652   29.1250          NaN        Q
17       0            244373   13.0000          NaN        S
18       0            345763   18.0000          NaN        S
19       0              2649    7.2250          NaN        C
20       0            239865   26.0000          NaN        S
21       0            248698   13.0000          D56        S
22       0            330923    8.0292          NaN        Q
23       0            113788   35.5000           A6        S
24       1            349909   21.0750          NaN        S
25       5            347077   31.3875          NaN        S
26       0              2631    7.2250          NaN        C
27       2             19950  263.0000  C23 C25 C27        S
28       0            330959    7.8792          NaN        Q
29       0            349216    7.8958          NaN        S
..     ...               ...       ...          ...      ...
861      0             28134   11.5000          NaN        S
862      0             17466   25.9292          D17        S
863      2          CA. 2343   69.5500          NaN        S
864      0            233866   13.0000          NaN        S
865      0            236852   13.0000          NaN        S
866      0     SC/PARIS 2149   13.8583          NaN        C
867      0          PC 17590   50.4958          A24        S
868      0            345777    9.5000          NaN        S
869      1            347742   11.1333          NaN        S
870      0            349248    7.8958          NaN        S
871      1             11751   52.5542          D35        S
872      0               695    5.0000  B51 B53 B55        S
873      0            345765    9.0000          NaN        S
874      0         P/PP 3381   24.0000          NaN        C
875      0              2667    7.2250          NaN        C
876      0              7534    9.8458          NaN        S
877      0            349212    7.8958          NaN        S
878      0            349217    7.8958          NaN        S
879      1             11767   83.1583          C50        C
880      1            230433   26.0000          NaN        S
881      0            349257    7.8958          NaN        S
882      0              7552   10.5167          NaN        S
883      0  C.A./SOTON 34068   10.5000          NaN        S
884      0   SOTON/OQ 392076    7.0500          NaN        S
885      5            382652   29.1250          NaN        Q
886      0            211536   13.0000          NaN        S
887      0            112053   30.0000          B42        S
888      2        W./C. 6607   23.4500          NaN        S
889      0            111369   30.0000         C148        C
890      0            370376    7.7500          NaN        Q

[891 rows x 12 columns]

In [77]:
print titanic.Fare.value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
10.5000    24
7.9250     18
7.7750     16
26.5500    15
0.0000     15
           ..
8.3000      1
13.7917     1
9.4750      1
13.4167     1
26.3875     1
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: Fare, Length: 248, dtype: int64

In [13]:
medals=pd.read_csv('../data/olympicmedals.csv')

In [14]:
medals.tail()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
29211,Beijing,2008,Wrestling,Wrestling Gre-R,"ENGLICH, Mirko",GER,Men,84 - 96kg,M,Silver
29212,Beijing,2008,Wrestling,Wrestling Gre-R,"MIZGAITIS, Mindaugas",LTU,Men,96 - 120kg,M,Bronze
29213,Beijing,2008,Wrestling,Wrestling Gre-R,"PATRIKEEV, Yuri",ARM,Men,96 - 120kg,M,Bronze
29214,Beijing,2008,Wrestling,Wrestling Gre-R,"LOPEZ, Mijain",CUB,Men,96 - 120kg,M,Gold
29215,Beijing,2008,Wrestling,Wrestling Gre-R,"BAROEV, Khasan",RUS,Men,96 - 120kg,M,Silver

In [78]:
medals.Sport.value_counts()

Aquatics             3828
Athletics            3448
Rowing               2523
Gymnastics           2214
Fencing              1547
Football             1387
Hockey               1325
Wrestling            1140
Shooting             1105
Sailing              1061
                     ...
Skating                27
Ice Hockey             27
Cricket                24
Triathlon              18
Rackets                10
Croquet                 8
Water Motorsports       5
Basque Pelota           4
Roque                   3
Jeu de paume            3
Name: Sport, Length: 42, dtype: int64

In [15]:
import pandas as pd
pd.Series

pandas.core.series.Series

In [16]:
from pandas import Series, DataFrame

In [17]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [18]:
obj = pd.Series([9, 6, -4, 8])
print obj

0    9
1    6
2   -4
3    8
dtype: int64

In [19]:
obj.values
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [20]:
obj2 = pd.Series([9, 6, -4, 8], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [21]:
obj2['a']
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    8
a   -4
d    6
dtype: int64

In [22]:
obj2[obj2 > 0]
obj2 * 2
np.exp(obj2)

d     403.428793
b     403.428793
a       0.018316
c    2980.957987
dtype: float64

In [23]:
'b' in obj2
'e' in obj2

False

In [24]:
sdata = {'Toronto': 11000, 'London': 22000, 'Oakville': 33000, 'Vaughan': 45000}
obj3 = pd.Series(sdata)
print obj3

London      22000
Oakville    33000
Toronto     11000
Vaughan     45000
dtype: int64

In [25]:
cities = ['Ontario', 'London', 'Oakville', 'Vaughan']
obj4 = pd.Series(sdata, index=cities)
print obj4

Ontario         NaN
London      22000.0
Oakville    33000.0
Vaughan     45000.0
dtype: float64

In [26]:
pd.isnull(obj4)
pd.notnull(obj4)

Ontario     False
London       True
Oakville     True
Vaughan      True
dtype: bool

In [27]:
obj4.isnull()

Ontario      True
London      False
Oakville    False
Vaughan     False
dtype: bool

In [28]:
obj3
obj4
obj3 + obj4

London      44000.0
Oakville    66000.0
Ontario         NaN
Toronto         NaN
Vaughan     90000.0
dtype: float64

In [29]:
obj4.name = 'population'
obj4.index.name = 'cities'
obj4

cities
Ontario         NaN
London      22000.0
Oakville    33000.0
Vaughan     45000.0
Name: population, dtype: float64

In [30]:
obj
obj.index = ['Roy', 'Matthew', 'Bob', 'Tom']
print obj

Roy        9
Matthew    6
Bob       -4
Tom        8
dtype: int64

In [31]:
data = {'Province': ['Ontario', 'Ontario', 'Ontario', 'Alberta', 'Alberta', 'Alberta', 'BC', 'BC'],
        'year': [2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2, 5.5, 3.8],
        'Birth' : [20.5, 22.5, 23.3, 15.6, 17.1, 19.3, 44.2, 24.9]}
frame = pd.DataFrame(data)
print frame

   Birth Province  pop  year
0   20.5  Ontario  1.5  2010
1   22.5  Ontario  1.7  2011
2   23.3  Ontario  3.6  2012
3   15.6  Alberta  2.4  2013
4   17.1  Alberta  2.9  2014
5   19.3  Alberta  3.2  2015
6   44.2       BC  5.5  2016
7   24.9       BC  3.8  2017

In [32]:
frame.head(8)

   Birth Province  pop  year
0   20.5  Ontario  1.5  2010
1   22.5  Ontario  1.7  2011
2   23.3  Ontario  3.6  2012
3   15.6  Alberta  2.4  2013
4   17.1  Alberta  2.9  2014
5   19.3  Alberta  3.2  2015
6   44.2       BC  5.5  2016
7   24.9       BC  3.8  2017

In [33]:
pd.DataFrame(data, columns=['year', 'Province', 'pop', 'Birth'])

   year Province  pop  Birth
0  2010  Ontario  1.5   20.5
1  2011  Ontario  1.7   22.5
2  2012  Ontario  3.6   23.3
3  2013  Alberta  2.4   15.6
4  2014  Alberta  2.9   17.1
5  2015  Alberta  3.2   19.3
6  2016       BC  5.5   44.2
7  2017       BC  3.8   24.9

In [34]:
frame2 = pd.DataFrame(data, columns=['year', 'Province', 'pop', 'Birth'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six', 'seven', 'eight'])
frame2
frame2.columns

Index([u'year', u'Province', u'pop', u'Birth'], dtype='object')

In [35]:
frame2['Province']
frame2.year

one      2010
two      2011
three    2012
four     2013
five     2014
six      2015
seven    2016
eight    2017
Name: year, dtype: int64

In [36]:
frame2.loc['five']

year           2014
Province    Alberta
pop             2.9
Birth          17.1
Name: five, dtype: object

In [37]:
frame2['birth'] = 16.5
frame2
frame2['birth'] = np.arange(8.)
frame2

       year Province  pop  Birth  birth
one    2010  Ontario  1.5   20.5    0.0
two    2011  Ontario  1.7   22.5    1.0
three  2012  Ontario  3.6   23.3    2.0
four   2013  Alberta  2.4   15.6    3.0
five   2014  Alberta  2.9   17.1    4.0
six    2015  Alberta  3.2   19.3    5.0
seven  2016       BC  5.5   44.2    6.0
eight  2017       BC  3.8   24.9    7.0

In [38]:
val = pd.Series([-1.2, -1.5, -1.7], index=['one', 'three', 'seven'])
frame2['birth'] = val
frame2

       year Province  pop  Birth  birth
one    2010  Ontario  1.5   20.5   -1.2
two    2011  Ontario  1.7   22.5    NaN
three  2012  Ontario  3.6   23.3   -1.5
four   2013  Alberta  2.4   15.6    NaN
five   2014  Alberta  2.9   17.1    NaN
six    2015  Alberta  3.2   19.3    NaN
seven  2016       BC  5.5   44.2   -1.7
eight  2017       BC  3.8   24.9    NaN

In [39]:
frame2['eastern'] = frame2.Province == 'Ontario'
frame2

       year Province  pop  Birth  birth  eastern
one    2010  Ontario  1.5   20.5   -1.2     True
two    2011  Ontario  1.7   22.5    NaN     True
three  2012  Ontario  3.6   23.3   -1.5     True
four   2013  Alberta  2.4   15.6    NaN    False
five   2014  Alberta  2.9   17.1    NaN    False
six    2015  Alberta  3.2   19.3    NaN    False
seven  2016       BC  5.5   44.2   -1.7    False
eight  2017       BC  3.8   24.9    NaN    False

In [40]:
del frame2['eastern']
frame2.columns

Index([u'year', u'Province', u'pop', u'Birth', u'birth'], dtype='object')

In [41]:
pop = {'Alberta': {2013: 2.4, 2014: 2.9},
       'Ontario': {2010: 1.5, 2011: 1.7, 2012: 3.6}}

In [42]:
frame3 = pd.DataFrame(pop)
print frame3

      Alberta  Ontario
2010      NaN      1.5
2011      NaN      1.7
2012      NaN      3.6
2013      2.4      NaN
2014      2.9      NaN

In [43]:
frame3.T

         2010  2011  2012  2013  2014
Alberta   NaN   NaN   NaN   2.4   2.9
Ontario   1.5   1.7   3.6   NaN   NaN

In [44]:
pd.DataFrame(pop, index=[2010, 2011, 2012, 2013, 2014])

      Alberta  Ontario
2010      NaN      1.5
2011      NaN      1.7
2012      NaN      3.6
2013      2.4      NaN
2014      2.9      NaN

In [45]:
pdata = {'Ontario': frame3['Ontario'][:-1],
         'Alberta': frame3['Alberta'][:2]}
pd.DataFrame(pdata)

      Alberta  Ontario
2010      NaN      1.5
2011      NaN      1.7
2012      NaN      3.6
2013      NaN      NaN

In [46]:
frame3.index.name = 'year'; frame3.columns.name = 'Province'
frame3

Province  Alberta  Ontario
year
2010          NaN      1.5
2011          NaN      1.7
2012          NaN      3.6
2013          2.4      NaN
2014          2.9      NaN

In [47]:
frame3.values

array([[ nan,  1.5],
       [ nan,  1.7],
       [ nan,  3.6],
       [ 2.4,  nan],
       [ 2.9,  nan]])

In [48]:
frame2.values

array([[2010, 'Ontario', 1.5, 20.5, -1.2],
       [2011, 'Ontario', 1.7, 22.5, nan],
       [2012, 'Ontario', 3.6, 23.3, -1.5],
       [2013, 'Alberta', 2.4, 15.6, nan],
       [2014, 'Alberta', 2.9, 17.1, nan],
       [2015, 'Alberta', 3.2, 19.3, nan],
       [2016, 'BC', 5.5, 44.2, -1.7],
       [2017, 'BC', 3.8, 24.9, nan]], dtype=object)

In [49]:
obj = pd.Series([2.5, 6.2, -5.5, 6.6], index=['k', 'l', 'm', 'n'])
print obj

k    2.5
l    6.2
m   -5.5
n    6.6
dtype: float64

In [50]:
obj2 = obj.reindex(['k', 'l', 'm', 'n', 'o'])
print obj2

k    2.5
l    6.2
m   -5.5
n    6.6
o    NaN
dtype: float64

In [51]:
obj3 = pd.Series(['apple', 'banana', 'strawberry'], index=[0, 3, 6])
obj3
obj3.reindex(range(9), method='ffill')

0         apple
1         apple
2         apple
3        banana
4        banana
5        banana
6    strawberry
7    strawberry
8    strawberry
dtype: object

In [52]:
frame = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['k', 'l', 'm', 'n'],
                     columns=['Ontario', 'Alberta', 'BC', 'Quebec'])
print frame
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ontario  Alberta  BC  Quebec
k        0        1   2       3
l        4        5   6       7
m        8        9  10      11
n       12       13  14      15

   Ontario  Alberta  BC  Quebec
a      NaN      NaN NaN     NaN
b      NaN      NaN NaN     NaN
c      NaN      NaN NaN     NaN
d      NaN      NaN NaN     NaN

In [53]:
Provinces = ['Ontario', 'Alberta', 'BC', 'Quebec']
frame.reindex(columns=Provinces)

   Ontario  Alberta  BC  Quebec
k        0        1   2       3
l        4        5   6       7
m        8        9  10      11
n       12       13  14      15

In [54]:
frame.loc[['k', 'l', 'm', 'n'], Provinces]

   Ontario  Alberta  BC  Quebec
k        0        1   2       3
l        4        5   6       7
m        8        9  10      11
n       12       13  14      15

In [55]:
obj = pd.Series(np.arange(5.), index=['k', 'l', 'm', 'n','o'])
obj
new_obj = obj.drop('n')
new_obj
obj.drop(['n','o'])

k    0.0
l    1.0
m    2.0
dtype: float64

In [56]:
data = pd.DataFrame(np.arange(25).reshape((5, 5)),
                    index=['Toronto', 'Oakville', 'Hamilton', 'Barrie', 'Woodbridge'],
                    columns=['one', 'two', 'three', 'four', 'five'])
data

            one  two  three  four  five
Toronto       0    1      2     3     4
Oakville      5    6      7     8     9
Hamilton     10   11     12    13    14
Barrie       15   16     17    18    19
Woodbridge   20   21     22    23    24

In [57]:
data.drop(['Oakville', 'Barrie'])

            one  two  three  four  five
Toronto       0    1      2     3     4
Hamilton     10   11     12    13    14
Woodbridge   20   21     22    23    24

In [58]:
data.drop('two', axis=1)
data.drop(['two', 'four'], axis='columns')

            one  three  five
Toronto       0      2     4
Oakville      5      7     9
Hamilton     10     12    14
Barrie       15     17    19
Woodbridge   20     22    24

In [59]:
obj = pd.Series(np.arange(6.), index=['k', 'l', 'm', 'n', 'o', 'p'])
obj
obj['l']
obj[1]
obj[2:6]
obj[['l', 'k', 'p']]
obj[[1, 5]]
obj[obj < 4]

k    0.0
l    1.0
m    2.0
n    3.0
dtype: float64

In [60]:
print obj['l':'o']

l    1.0
m    2.0
n    3.0
o    4.0
dtype: float64

In [61]:
obj['m':'n'] = 5
obj

k    0.0
l    1.0
m    5.0
n    5.0
o    4.0
p    5.0
dtype: float64

In [62]:
data = pd.DataFrame(np.arange(25).reshape((5, 5)),
                    index=['blue', 'green', 'yellow', 'orange', 'red'],
                    columns=['one', 'two', 'three', 'four', 'five'])
data

data[['four', 'five', 'one']]

        four  five  one
blue       3     4    0
green      8     9    5
yellow    13    14   10
orange    18    19   15
red       23    24   20

In [63]:
data[:2]
data[data['three'] > 8]

        one  two  three  four  five
yellow   10   11     12    13    14
orange   15   16     17    18    19
red      20   21     22    23    24

In [64]:
data < 5
data[data < 8] = 1
print data

        one  two  three  four  five
blue      1    1      1     1     1
green     1    1      1     8     9
yellow   10   11     12    13    14
orange   15   16     17    18    19
red      20   21     22    23    24

In [65]:
data.loc['yellow', ['two', 'four']]

two     11
four    13
Name: yellow, dtype: int64

In [66]:
data.iloc[3, [4, 0, 1]]
data.iloc[3]
data.iloc[[2, 3], [4, 0, 1]]

        five  one  two
yellow    14   10   11
orange    19   15   16

In [67]:
data.loc[:'yellow', 'two']
data.iloc[:, :3][data.three > 8]

        one  two  three
yellow   10   11     12
orange   15   16     17
red      20   21     22

In [68]:
ser = pd.Series(np.arange(8.))
print ser

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
dtype: float64

In [69]:
ser2 = pd.Series(np.arange(8.), index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
ser2[-5]

3.0

In [70]:
ser[:3]
ser.loc[:3]
ser.iloc[:3]

0    0.0
1    1.0
2    2.0
dtype: float64

In [71]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['k', 'm', 'n', 'o'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['k', 'l', 'n', 'o', 'p'])
print s1
print s2

k    7.3
m   -2.5
n    3.4
o    1.5
dtype: float64
k   -2.1
l    3.6
n   -1.5
o    4.0
p    3.1
dtype: float64

In [72]:
print s1 + s2

k    5.2
l    NaN
m    NaN
n    1.9
o    5.5
p    NaN
dtype: float64

In [73]:
df1 = pd.DataFrame(np.arange(16.).reshape((4, 4)), columns=list('klmn'),
                   index=['Orange', 'Blue', 'Green', 'Purple'])
df2 = pd.DataFrame(np.arange(25.).reshape((5, 5)), columns=list('jklop'),
                   index=['Yellow', 'Orange', 'Blue', 'Pink', 'Black'])
print df1
print df2

           k     l     m     n
Orange   0.0   1.0   2.0   3.0
Blue     4.0   5.0   6.0   7.0
Green    8.0   9.0  10.0  11.0
Purple  12.0  13.0  14.0  15.0
           j     k     l     o     p
Yellow   0.0   1.0   2.0   3.0   4.0
Orange   5.0   6.0   7.0   8.0   9.0
Blue    10.0  11.0  12.0  13.0  14.0
Pink    15.0  16.0  17.0  18.0  19.0
Black   20.0  21.0  22.0  23.0  24.0

In [74]:
print df1 + df2

         j     k     l   m   n   o   p
Black  NaN   NaN   NaN NaN NaN NaN NaN
Blue   NaN  15.0  17.0 NaN NaN NaN NaN
Green  NaN   NaN   NaN NaN NaN NaN NaN
Orange NaN   6.0   8.0 NaN NaN NaN NaN
Pink   NaN   NaN   NaN NaN NaN NaN NaN
Purple NaN   NaN   NaN NaN NaN NaN NaN
Yellow NaN   NaN   NaN NaN NaN NaN NaN

In [75]:
df1 = pd.DataFrame({'A': [5, 6]})
df2 = pd.DataFrame({'B': [3, 4]})
df1
df2
print df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [76]:
df1 = pd.DataFrame({'A': [5, 6]})
df2 = pd.DataFrame({'A': [3, 4]})
df1
df2
print df1 - df2

   A
0  2
1  2